START_TEXT = '👋 Добро пожаловать!\n\nВ данном боте Вы можете арендовать трафик на прокси-сервере.\n\nВыберите нужный пункт из меню ниже 👇'

BUY_BUTTON = '🌐 Купить конфигурацию'
PROFILE_BUTTON = '👤 Профиль'
HELP_BUTTON = '📖 Инструкции'
SUPPORT_BUTTON = '👨🏻‍💻 Поддержка'

HELP_TEXT = '📖 Инструкции\n\n1. Скопируйте полученную конфигурацию (вида vless://...)\n2. Скачайте приложение V2RayTun или аналогичное.\n3. Откройте приложение и нажмите на "+" для добавления новой конфигурации\n4. Выберите "Добавить из буфера"\n5. Разрешите добавление конфигурации'

BUY_TEXT = '🌐 Купить конфигурацию\n\nВыберите интересующий Вас тариф 👇'

PAY_TEXT = '🌐 Купить конфигурацию на <b>{period}</b>\n\nОтличный выбор! Для перехода на страницу оплаты нажмите на соответсвующую кнопку в меню, после, нажмите на "✅ Я оплатил(а)!" для автоматической проверки.\n\nЕсли платеж подтвердится - бот сразу вышлет Вам конфигурацию!'

PAY_BUTTON = '💸 Перейти на оплату'
CHECK_BUTTON = '✅ Я оплатил(а)!'

SUCCESS_PAY_TEXT = '✅ Платеж подтвержден, спасибо за покупку!\n\nКонфигурационный файл:\n\n<code>{config}</code>'
ERROR_PAY_TEXT = 'Оплата неподтверждена! Попробуйте через пару минут...'

PROFILE_TEXT = '👤 Профиль\n\nДата истечения аренды: {date}\n\nКонфигурационный файл:\n\n<code>{config}</code>'

BACK_BUTTON = '⏪ Назад'

BILL_TEXT = 'Оплата аренды трафика на {period}'

NOT_BUYED_TEXT = 'Похоже, Вы ещё не арендовали трафик...'
ERROR_TEXT = 'Что-то пошло не так...'
